weiyanni/XMC4300/XMC4300-app/SSC/Src/ryhand.c
/*
* This source file is part of the EtherCAT Slave Stack Code licensed by Beckhoff Automation GmbH & Co KG, 33415 Verl, Germany.
* The corresponding license agreement applies. This hint shall not be removed.
*/

/**
\addtogroup ryhand ryhand
@{
*/

/**
\file ryhand.c
\brief Implementation
 Created with SSC Tool application parser 1.6.4.0
\version 0.0.0.1
*/


/*-----------------------------------------------------------------------------------------
------
------    Includes
------
-----------------------------------------------------------------------------------------*/
#include "ecat_def.h"

#include "applInterface.h"
#include <string.h>
#include <stdint.h>
#include "XMC4300.h"  /* 访问 ECAT0 寄存器 */
#include "BSP/app_init.h"

#define _RYHAND_ 1
#include "ryhand.h"
#include "bsp_can.h"
#undef _RYHAND_
#define PDO_PAYLOAD_PTR(obj)   ((uint8_t *)&(obj) + sizeof((obj).u16SubIndex0))
#define PDO_PAYLOAD_LEN(obj)   ((uint16_t)(sizeof(obj) - sizeof((obj).u16SubIndex0)))
/*--------------------------------------------------------------------------------------
------
------    local types and defines
------
--------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------
------
------    local variables and constants
------
-----------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------
------
------    application specific functions
------
-----------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------
------
------    generic functions
------
-----------------------------------------------------------------------------------------*/

/////////////////////////////////////////////////////////////////////////////////////////
/**
 \brief    The function is called when an error state was acknowledged by the master

*////////////////////////////////////////////////////////////////////////////////////////

void    APPL_AckErrorInd(UINT16 stateTrans)
{

}

/////////////////////////////////////////////////////////////////////////////////////////
/**
 \return    AL Status Code (see ecatslv.h ALSTATUSCODE_....)

 \brief    The function is called in the state transition from INIT to PREOP when
             all general settings were checked to start the mailbox handler. This function
             informs the application about the state transition, the application can refuse
             the state transition when returning an AL Status error code.
            The return code NOERROR_INWORK can be used, if the application cannot confirm
            the state transition immediately, in that case this function will be called cyclically
            until a value unequal NOERROR_INWORK is returned

*////////////////////////////////////////////////////////////////////////////////////////

UINT16 APPL_StartMailboxHandler(void)
{
    return ALSTATUSCODE_NOERROR;
}

/////////////////////////////////////////////////////////////////////////////////////////
/**
 \return     0, NOERROR_INWORK

 \brief    The function is called in the state transition from PREEOP to INIT
             to stop the mailbox handler. This functions informs the application
             about the state transition, the application cannot refuse
             the state transition.

*////////////////////////////////////////////////////////////////////////////////////////

UINT16 APPL_StopMailboxHandler(void)
{
    return ALSTATUSCODE_NOERROR;
}

/////////////////////////////////////////////////////////////////////////////////////////
/**
 \param    pIntMask    pointer to the AL Event Mask which will be written to the AL event Mask
                       register (0x204) when this function is succeeded. The event mask can be adapted
                       in this function
 \return    AL Status Code (see ecatslv.h ALSTATUSCODE_....)

 \brief    The function is called in the state transition from PREOP to SAFEOP when
           all general settings were checked to start the input handler. This function
           informs the application about the state transition, the application can refuse
           the state transition when returning an AL Status error code.
           The return code NOERROR_INWORK can be used, if the application cannot confirm
           the state transition immediately, in that case the application need to be complete 
           the transition by calling ECAT_StateChange.
*////////////////////////////////////////////////////////////////////////////////////////

UINT16 APPL_StartInputHandler(UINT16 *pIntMask)
{
    return ALSTATUSCODE_NOERROR;
}

/////////////////////////////////////////////////////////////////////////////////////////
/**
 \return     0, NOERROR_INWORK

 \brief    The function is called in the state transition from SAFEOP to PREEOP
             to stop the input handler. This functions informs the application
             about the state transition, the application cannot refuse
             the state transition.

*////////////////////////////////////////////////////////////////////////////////////////

UINT16 APPL_StopInputHandler(void)
{
    return ALSTATUSCODE_NOERROR;
}

/////////////////////////////////////////////////////////////////////////////////////////
/**
 \return    AL Status Code (see ecatslv.h ALSTATUSCODE_....)

 \brief    The function is called in the state transition from SAFEOP to OP when
             all general settings were checked to start the output handler. This function
             informs the application about the state transition, the application can refuse
             the state transition when returning an AL Status error code.
           The return code NOERROR_INWORK can be used, if the application cannot confirm
           the state transition immediately, in that case the application need to be complete 
           the transition by calling ECAT_StateChange.
*////////////////////////////////////////////////////////////////////////////////////////

UINT16 APPL_StartOutputHandler(void)
{
    return ALSTATUSCODE_NOERROR;
}

/////////////////////////////////////////////////////////////////////////////////////////
/**
 \return     0, NOERROR_INWORK

 \brief    The function is called in the state transition from OP to SAFEOP
             to stop the output handler. This functions informs the application
             about the state transition, the application cannot refuse
             the state transition.

*////////////////////////////////////////////////////////////////////////////////////////

UINT16 APPL_StopOutputHandler(void)
{
    return ALSTATUSCODE_NOERROR;
}

//#ifdef _OBJD_
///**
// * 强行修复对象字典指针偏移逻辑
// */
//void FixObjectDictionaryPointers(void)
//{
//    UINT16 i;
//    // 遍历字典数组，直到遇到 0xFFFF 结束符
//    for (i = 0; ApplicationObjDic[i].Index != 0xFFFF; i++)
//    {
//        // 1. 强制建立链表连接（解决你之前遇到的死循环问题）
//        ApplicationObjDic[i].pNext = (struct OBJ_ENTRY *)&ApplicationObjDic[i+1];
//
//        // 2. 针对 0x8000 对象，强制将损坏的指针指回正确的数组地址
//        if (ApplicationObjDic[i].Index == 0x8000)
//        {
//            ApplicationObjDic[i].pEntryDesc = (TSDOINFOENTRYDESC OBJMEM *)asEntryDesc0x8000;
//        }
//    }
//    // 确保最后一个节点的 pNext 封顶
//    ApplicationObjDic[i].pNext = NULL;
//}
//#endif

/////////////////////////////////////////////////////////////////////////////////////////
/**
\return     0(ALSTATUSCODE_NOERROR), NOERROR_INWORK
\param      pInputSize  pointer to save the input process data length
\param      pOutputSize  pointer to save the output process data length

\brief    This function calculates the process data sizes from the actual SM-PDO-Assign
            and PDO mapping
*////////////////////////////////////////////////////////////////////////////////////////
UINT16 APPL_GenerateMapping(UINT16 *pInputSize,UINT16 *pOutputSize)
{
    UINT16 result = ALSTATUSCODE_NOERROR;
    UINT16 InputSize = 0;
    UINT16 OutputSize = 0;

//#ifdef _OBJD_
//    void FixObjectDictionaryPointers(void); // 局部声明
//    FixObjectDictionaryPointers(); // 在映射生成前修正指针
//#endif

#if COE_SUPPORTED
    UINT16 PDOAssignEntryCnt = 0;
    OBJCONST TOBJECT OBJMEM * pPDO = NULL;
    UINT16 PDOSubindex0 = 0;
    UINT32 *pPDOEntry = NULL;
    UINT16 PDOEntryCnt = 0;
   
#if MAX_PD_OUTPUT_SIZE > 0
    /*Scan object 0x1C12 RXPDO assign*/
    for(PDOAssignEntryCnt = 0; PDOAssignEntryCnt < sRxPDOassign.u16SubIndex0; PDOAssignEntryCnt++)
    {
        pPDO = OBJ_GetObjectHandle(sRxPDOassign.aEntries[PDOAssignEntryCnt]);
        if(pPDO != NULL)
        {
            PDOSubindex0 = *((UINT16 *)pPDO->pVarPtr);
            for(PDOEntryCnt = 0; PDOEntryCnt < PDOSubindex0; PDOEntryCnt++)
            {
                pPDOEntry = (UINT32 *)(((UINT16 *)pPDO->pVarPtr) + (OBJ_GetEntryOffset((PDOEntryCnt+1),pPDO)>>4));    //goto PDO entry
                // we increment the expected output size depending on the mapped Entry
                OutputSize += (UINT16) ((*pPDOEntry) & 0xFF);
            }
        }
        else
        {
            /*assigned PDO was not found in object dictionary. return invalid mapping*/
            OutputSize = 0;
            result = ALSTATUSCODE_INVALIDOUTPUTMAPPING;
            break;
        }
    }

    OutputSize = (OutputSize + 7) >> 3;
#endif

#if MAX_PD_INPUT_SIZE > 0
    if(result == 0)
    {
        /*Scan Object 0x1C13 TXPDO assign*/
        for(PDOAssignEntryCnt = 0; PDOAssignEntryCnt < sTxPDOassign.u16SubIndex0; PDOAssignEntryCnt++)
        {
            pPDO = OBJ_GetObjectHandle(sTxPDOassign.aEntries[PDOAssignEntryCnt]);
            if(pPDO != NULL)
            {
                PDOSubindex0 = *((UINT16 *)pPDO->pVarPtr);
                for(PDOEntryCnt = 0; PDOEntryCnt < PDOSubindex0; PDOEntryCnt++)
                {
                    pPDOEntry = (UINT32 *)(((UINT16 *)pPDO->pVarPtr) + (OBJ_GetEntryOffset((PDOEntryCnt+1),pPDO)>>4));    //goto PDO entry
                    // we increment the expected output size depending on the mapped Entry
                    InputSize += (UINT16) ((*pPDOEntry) & 0xFF);
                }
            }
            else
            {
                /*assigned PDO was not found in object dictionary. return invalid mapping*/
                InputSize = 0;
                result = ALSTATUSCODE_INVALIDINPUTMAPPING;
                break;
            }
        }
    }
    InputSize = (InputSize + 7) >> 3;
#endif

#else
#if _WIN32
   #pragma message ("Warning: Define 'InputSize' and 'OutputSize'.")
#else
    #warning "Define 'InputSize' and 'OutputSize'."
#endif
#endif

    *pInputSize = InputSize;
    *pOutputSize = OutputSize;
    return result;
}

/////////////////////////////////////////////////////////////////////////////////////////
/**
\param      pData  pointer to input process data

\brief      This function will copies the inputs from the local memory to the ESC memory
            to the hardware
*////////////////////////////////////////////////////////////////////////////////////////
void APPL_InputMapping(UINT16 *pData)   /* Slave -> Master (TxPDO) */
{
    uint8_t *p = (uint8_t *)pData;
    uint16_t n = sTxPDOassign.u16SubIndex0;          /* 0x1C13:0 */ /* [file:254] */

    for (uint16_t i = 0; i < n; i++)
    {
        switch (sTxPDOassign.aEntries[i])           /* 0x1C13:1..n */ /* [file:254] */
        {
            case 0x1A00: /* <- 0x6000 */
                memcpy(p, PDO_PAYLOAD_PTR(Txpdo160x6000), PDO_PAYLOAD_LEN(Txpdo160x6000)); /* [file:254] */
                p += PDO_PAYLOAD_LEN(Txpdo160x6000);
                break;

            case 0x1A01: /* <- 0x6010 */
                memcpy(p, PDO_PAYLOAD_PTR(Txpdo60x6010), PDO_PAYLOAD_LEN(Txpdo60x6010));   /* [file:254] */
                p += PDO_PAYLOAD_LEN(Txpdo60x6010);
                break;

            case 0x1A02: /* <- 0x6020 */
                memcpy(p, PDO_PAYLOAD_PTR(Txpdo_TS0x6020), PDO_PAYLOAD_LEN(Txpdo_TS0x6020)); /* [file:254] */
                p += PDO_PAYLOAD_LEN(Txpdo_TS0x6020);
                break;

            default:
                break;
        }
    }
}

/////////////////////////////////////////////////////////////////////////////////////////
/**
\param      pData  pointer to output process data

\brief    This function will copies the outputs from the ESC memory to the local memory
            to the hardware
*////////////////////////////////////////////////////////////////////////////////////////
void APPL_OutputMapping(UINT16 *pData)  /* Master -> Slave (RxPDO) */
{
    uint8_t *p = (uint8_t *)pData;
    uint16_t n = sRxPDOassign.u16SubIndex0;          /* 0x1C12:0 */  /* [file:254] */

    for (uint16_t i = 0; i < n; i++)
    {
        switch (sRxPDOassign.aEntries[i])           /* 0x1C12:1..n */ /* [file:254] */
        {
            case 0x1600: /* -> 0x7000 */
                memcpy(PDO_PAYLOAD_PTR(Rxpdo160x7000), p, PDO_PAYLOAD_LEN(Rxpdo160x7000)); /* [file:254] */
                p += PDO_PAYLOAD_LEN(Rxpdo160x7000);
                break;

            case 0x1601: /* -> 0x7010 */
                memcpy(PDO_PAYLOAD_PTR(Rxpdo60x7010), p, PDO_PAYLOAD_LEN(Rxpdo60x7010));   /* [file:254] */
                p += PDO_PAYLOAD_LEN(Rxpdo60x7010);
                break;

            case 0x1602: /* -> 0x7020 */
                memcpy(PDO_PAYLOAD_PTR(Rxpdo6_TS0x7020), p, PDO_PAYLOAD_LEN(Rxpdo6_TS0x7020)); /* [file:254] */
                p += PDO_PAYLOAD_LEN(Rxpdo6_TS0x7020);
                break;

            default:
                break;
        }
    }
}

// 定义一个辅助结构体，方便按通道访问
typedef struct {
    UINT16 len;
    CHAR   data[24];
} TChannelUnit;
static TOBJ7000 last_7000;
static TOBJ7010 last_7010;
static TOBJ7020 last_7020;
/////////////////////////////////////////////////////////////////////////////////////////
/**
\brief    This function will called from the synchronisation ISR 
            or from the mainloop if no synchronisation is supported
*////////////////////////////////////////////////////////////////////////////////////////
void APPL_Application(void)
{
    /* 
     * 注意: 不要在此处读取 AL_CONTROL 寄存器！
     * 这会干扰 SSC 协议栈的状态机，导致状态切换异常。
     * 
     * Bootstrap 处理已移至 BSP/bootmode.c 的 BL_Start() 钩子函数。
     * 请确保将 SSC/Src/bootmode.c 从编译中排除。
     */

    // --- 处理 0x7000 (16个通道) ---
    if (memcmp(&last_7000, &Rxpdo160x7000, sizeof(TOBJ7000)) != 0)
    {
    	// 核心技巧：获取第一个通道的地址 (跳过 SubIndex0 的 2 字节)
		TChannelUnit *pCurrentArr = (TChannelUnit *)((UINT8*)&Rxpdo160x7000 + 2);
		TChannelUnit *pLastArr    = (TChannelUnit *)((UINT8*)&last_7000 + 2);

		// 开始一个通道一个通道地对比和处理
		for (int i = 0; i < (sizeof(TOBJ7000) - sizeof(UINT16)) / sizeof(TChannelUnit); i++)
		{
			// 检查当前这个通道的数据是否发生了变化
			if (memcmp(&pCurrentArr[i], &pLastArr[i], sizeof(TChannelUnit)) != 0)
			{
				// 计算当前是哪个通道 (1-16)
				int channelNum = i + 1;
				Forward_MultiChannel_Obj_Auto(&Rxpdo160x7000, &last_7000, channelNum);

				// 处理完该通道后，立即同步该通道的旧值缓存
				memcpy(&pLastArr[i], &pCurrentArr[i], sizeof(TChannelUnit));
			}
		}

		memcpy(&last_7000, &Rxpdo160x7000, sizeof(TOBJ7000));
    }

    // --- 处理 0x7010 (6个通道) ---
    if (memcmp(&last_7010, &Rxpdo60x7010, sizeof(TOBJ7010)) != 0)
    {
    	// 核心技巧：获取第一个通道的地址 (跳过 SubIndex0 的 2 字节)
		TChannelUnit *pCurrentArr = (TChannelUnit *)((UINT8*)&Rxpdo60x7010 + 2);
		TChannelUnit *pLastArr    = (TChannelUnit *)((UINT8*)&last_7010 + 2);

		// 开始一个通道一个通道地对比和处理
		for (int i = 0; i < (sizeof(TOBJ7010) - sizeof(UINT16)) / sizeof(TChannelUnit); i++)
		{
			// 检查当前这个通道的数据是否发生了变化
			if (memcmp(&pCurrentArr[i], &pLastArr[i], sizeof(TChannelUnit)) != 0)
			{
				// 计算当前是哪个通道 (1-16)
				int channelNum = i + 1;
				Forward_MultiChannel_Obj_Auto(&Rxpdo60x7010, &last_7010, channelNum+16);

				// 处理完该通道后，立即同步该通道的旧值缓存
				memcpy(&pLastArr[i], &pCurrentArr[i], sizeof(TChannelUnit));
			}
		}

		memcpy(&last_7010, &Rxpdo60x7010, sizeof(TOBJ7010));
    }

    // --- 处理 0x7020 (6个通道) ---
    if (memcmp(&last_7020, &Rxpdo6_TS0x7020, sizeof(TOBJ7020)) != 0)
    {
    	// 核心技巧：获取第一个通道的地址 (跳过 SubIndex0 的 2 字节)
		TChannelUnit *pCurrentArr = (TChannelUnit *)((UINT8*)&Rxpdo6_TS0x7020 + 2);
		TChannelUnit *pLastArr    = (TChannelUnit *)((UINT8*)&last_7020 + 2);

		// 开始一个通道一个通道地对比和处理
		for (int i = 0; i < (sizeof(TOBJ7020) - sizeof(UINT16)) / sizeof(TChannelUnit); i++)
		{
			// 检查当前这个通道的数据是否发生了变化
			if (memcmp(&pCurrentArr[i], &pLastArr[i], sizeof(TChannelUnit)) != 0)
			{
				// 计算当前是哪个通道 (1-16)
				int channelNum = i + 1;
				Forward_MultiChannel_Obj_Auto(&Rxpdo6_TS0x7020, &last_7020, channelNum);

				// 处理完该通道后，立即同步该通道的旧值缓存
				memcpy(&pLastArr[i], &pCurrentArr[i], sizeof(TChannelUnit));
			}
		}

		memcpy(&last_7020, &Rxpdo6_TS0x7020, sizeof(TOBJ7020));
    }
}

#if EXPLICIT_DEVICE_ID
/////////////////////////////////////////////////////////////////////////////////////////
/**
 \return    The Explicit Device ID of the EtherCAT slave

 \brief     Read the Explicit Device ID (from an external ID switch)
*////////////////////////////////////////////////////////////////////////////////////////
UINT16 APPL_GetDeviceID()
{
#if _WIN32
   #pragma message ("Warning: Implement explicit Device ID latching")
#else
    #warning "Implement explicit Device ID latching"
#endif
    /* Explicit Device 5 is expected by Explicit Device ID conformance tests*/
    return 0x5;
}
#endif



/////////////////////////////////////////////////////////////////////////////////////////
/**
\param     index               index of the requested object.
\param     subindex            subindex of the requested object.
\param     objSize             size of the requested object data, calculated with OBJ_GetObjectLength
\param     pData               Pointer to the buffer where the data can be copied to
\param     bCompleteAccess     Indicates if a complete read of all subindices of the
                               object shall be done or not

 \return    result of the read operation (0 (success) or an abort code (ABORTIDX_.... defined in
            sdosrv.h))
 *////////////////////////////////////////////////////////////////////////////////////////
UINT8 WriteSimulateCANFD(UINT16 index, UINT8 subindex, UINT32 dataSize, UINT16 MBXMEM * pData, UINT8 bCompleteAccess) {
	return SDO_WriteCallback(index, subindex, dataSize, pData, bCompleteAccess);
}
#if USE_DEFAULT_MAIN
/////////////////////////////////////////////////////////////////////////////////////////
/**

 \brief    This is the main function

*////////////////////////////////////////////////////////////////////////////////////////
#if _PIC24 && EL9800_HW
int main(void)
#elif _WIN32
int main(int argc, char* argv[])
#else
void main(void)
#endif
{
    /* initialize the Hardware and the EtherCAT Slave Controller */
#if FC1100_HW
#if _WIN32
    u16FcInstance = 0;
    if (argc > 1)
    {
        u16FcInstance = atoi(argv[1]);
    }
#endif
    if(HW_Init())
    {
        HW_Release();
        return;
    }
#else
    HW_Init();
#endif
    MainInit();

    bRunApplication = TRUE;
    do
    {
        MainLoop();
        
    } while (bRunApplication == TRUE);

    HW_Release();
#if _PIC24
    return 0;
#endif
}
#endif //#if USE_DEFAULT_MAIN
/** @} */

